// 1 ~ 100 까지의 합계(for)
var sum = 0;
for(var i=1; i<=100; i++){
  sum += i;
}
console.log('1 ~ 100 까지의 합계: ' + sum);

// 1부터 누적했을때 얼마까지 누적하면 1000000을 넘는가?(while)
var count = 1;
sum = 0;
while(sum < 1000000){
  sum += count;
  count++;
}
/**
 * 연산자 우선 순위
 * 0, 증감연산자(++,--... 전위형)
 * 1. 산술연산자(+,-...)
 * 2. 비교연산자(>,<...)
 * 3. 논리연산자(&&,||...)
 * 4. 대입연산자(=,+=...)
 * 5. 증감연산자(++,--... 후위형)
 */
count--;
console.log('1부터 ' + count + '까지 누적하면 합계는 ' + sum);

// 로또 1등 당첨 확률
// 45!/(6!*39!)
var a = 1; // 분자. 45!
var b = 1; // 부모. (6!*39!)

for(var i=45; i>1; i--){
  a *= i;
}
for(var i=6; i>1; i--){
  b *= i;
}
for(var i=39; i>1; i--){
  b *= i;
}

console.log('로또 1등 당첨 확률은 1/' + Math.round(a/b));
